Revit 2027 API
BuiltInFailures.SketchFailures.NoLoops Property
 Sketch is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoLoops { get; }
Public Shared ReadOnly Property NoLoops As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoLoops {
	FailureDefinitionId^ get ();
}
static member NoLoops : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace